Revit 2027 API
Application.FailuresProcessing Event
 Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<FailuresProcessingEventArgs> FailuresProcessing
Public Event FailuresProcessing As EventHandler(Of FailuresProcessingEventArgs)
public:
 event EventHandler<FailuresProcessingEventArgs^>^ FailuresProcessing {
	void add (EventHandler<FailuresProcessingEventArgs^>^ value);
	void remove (EventHandler<FailuresProcessingEventArgs^>^ value);
}
member FailuresProcessing : IEvent<EventHandler<FailuresProcessingEventArgs>,
    FailuresProcessingEventArgs>
Value
EventHandler<FailuresProcessingEventArgs>
Remarks
This event is raised when failures are being processed during transaction commit or rollback operations. Handlers of this event have a limited ability to modify the document and/or failures in it, using the provided restricted failures accessor interface.
The event arguments provide access to the FailuresAccessor via [!:Autodesk::Revit::DB::FailuresProcessingEventArgs::GetFailuresAccessor()] which contains the details of the errors and/or warnings that caused the event to trigger.
 The arguments also allow you to set a processing result via [!:Autodesk::Revit::DB::FailuresProcessingEventArgs::SetProcessingResult()]. The processing result determines if Revit will attempt to recommit the currently failing transaction, roll it back, or continue. If you are explicitly dismissing warnings from the event callback, a processing result of Continue is sufficient. But if you are explicitly resolving errors from the event callback, you must change the processing result to ProceedWithCommit to ensure that the user is not shown the dismissed errors. If you wish to cancel the transaction silently without showing the errors to the user, set the processing result to ProceedWithRollback, however you must also call SetClearAfterRollback(Boolean) in order to dismiss the errors and silently cancel the transaction.
Example
[Autodesk.Revit.Attributes.Transaction(Autodesk.Revit.Attributes.TransactionMode.Manual)]
 public class NoUnenclosedRoomWarnings : IExternalApplication
 {
     static AddInId m_appId = new AddInId(new Guid("EB296268-8364-4d25-96E6-F664C608503C"));
     public Result OnStartup(UIControlledApplication application)
     {
         //Create an API application that subscribes to FailuresProcessing event for the lifetime of the session.
         application.ControlledApplication.FailuresProcessing += new EventHandler<FailuresProcessingEventArgs>(CheckWarnings);
         return Result.Succeeded;
     }
     public Result OnShutdown(UIControlledApplication application)
     {
         return Result.Succeeded;
     }
     private void CheckWarnings(object sender, FailuresProcessingEventArgs e)
     {
         FailuresAccessor fa = e.GetFailuresAccessor();
         IList<FailureMessageAccessor> failList = new List<FailureMessageAccessor>();
         failList = fa.GetFailureMessages(); // Inside event handler, get all warnings
         foreach (FailureMessageAccessor failure in failList)
         {
             // check FailureDefinitionIds against ones that you want to dismiss,
             FailureDefinitionId failID = failure.GetFailureDefinitionId();
             // prevent Revit from showing Unenclosed room warnings
             if (failID == BuiltInFailures.RoomFailures.RoomNotEnclosed)
             {
                 fa.DeleteWarning(failure);
             }
         }
     }
 }
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace